#include <locale.h>
#include <stdio.h>

int a, b;
void main()
{
	setlocale(LC_ALL, "RUS");
	puts("¬ведите два числа через пробел:");
	scanf_s("%d %d", &a, &b);
	int mh = 5;
	printf("________________________________________________________________\n");
	printf("|%*20s|%*20s|%*20s|\n", mh, "a*b", mh, "a+b", mh, "a-b");
	printf("________________________________________________________________\n" );
	printf("|%10d*%-9d|%10d+%-9d|%10d-%-9d|\n", a, b, a, b,  a, b );
	printf("________________________________________________________________\n");
	printf("|%20d|%20d|%20d|\n", a * b, a + b, a - b );
}